---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidMeasurementType(Autodesk.Revit.DB.DividedPathMeasurementType)
source: html/0c0e00f5-bbd5-4407-9631-f55323ec970e.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidMeasurementType Method

Checks that the measurement type enumeration value is valid

## Syntax (C#)
```csharp
public bool IsValidMeasurementType(
	DividedPathMeasurementType measurementType
)
```

## Parameters
- **measurementType** (`Autodesk.Revit.DB.DividedPathMeasurementType`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration